/******************************************************************************

                  版权所有 (C), 2001-2016, 华为技术有限公司

 ******************************************************************************
  文 件 名   : MtcInterface.h
  版 本 号   : 初稿
  作    者   : z00347560
  生成日期   : 2016年03月22日
  最近修改   :
  功能描述   : MTC模块对外部接口头文件
  函数列表   :
  修改历史   :
  1.日    期   : 2016年03月22日
    作    者   : z00347560
    修改内容   : 创建文件

******************************************************************************/

#ifndef _MTCINTERFACE_H_
#define _MTCINTERFACE_H_

/*****************************************************************************
  1 其他头文件包含
*****************************************************************************/
#include "vos.h"
#include "PsTypeDef.h"


#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif

#pragma pack(4)

/*****************************************************************************
  2 宏定义
*****************************************************************************/
#define NAS_MTC_CHINA_TIME_ZONE         (8)

#define NAS_MTC_TIME_ZERO_CLOCK         (0)
#define NAS_MTC_TIME_TWENTY_FOUR_CLOCK  (24)
#define NAS_MTC_TIME_ZONE_MIN           (-12)
#define NAS_MTC_TIME_ZONE_MAX           (12)

/*****************************************************************************
  3 枚举定义
*****************************************************************************/

/*****************************************************************************
 枚举名    : MTA_MTC_SENSOR_STAT_ENUM
 结构说明  : Sensor Hub状态
 1.日    期   : 2016年3月22日
   作    者   : z00347560
   修改内容   : 新增枚举
*****************************************************************************/
enum MTA_MTC_SENSOR_STAT_ENUM
{
    MTA_MTC_SENSOR_STAT_IN_VEHICLE      = 0x00,                                /* 车载 */
    MTA_MTC_SENSOR_STAT_ON_BICYCLE      = 0x01,                                /* 骑车 */
    MTA_MTC_SENSOR_STAT_WALKING         = 0x02,                                /* 慢走 */
    MTA_MTC_SENSOR_STAT_RUNNING         = 0x03,                                /* 快跑 */
    MTA_MTC_SENSOR_STAT_STILL           = 0x04,                                /* 静止 */
    MTA_MTC_SENSOR_STAT_UNKNOWN         = 0x05,                                /* 未知 */

    MTA_MTC_SENSOR_STAT_BUTT
};
typedef VOS_UINT8  MTA_MTC_SENSOR_STAT_ENUM_UINT8;

/*****************************************************************************
 枚举名    : MTA_MTC_SCREEN_STAT_ENUM
 结构说明  : Screen状态
 1.日    期   : 2016年3月22日
   作    者   : z00347560
   修改内容   : 新增枚举
*****************************************************************************/
enum MTA_MTC_SCREEN_STAT_ENUM
{
    MTA_MTC_SCREEN_STAT_OFF            =0x00,                                 /* 灭屏 */
    MTA_MTC_SCREEN_STAT_ON,                                                   /* 亮屏 */

    MTA_MTC_SCREEN_STAT_BUTT
};
typedef VOS_UINT8  MTA_MTC_SCREEN_STAT_ENUM_UINT8;

/*****************************************************************************
  4 全局变量声明
*****************************************************************************/


/*****************************************************************************
  5 消息头定义
*****************************************************************************/


/*****************************************************************************
  6 消息定义
*****************************************************************************/


/*****************************************************************************
  7 STRUCT定义
*****************************************************************************/

/*****************************************************************************
  8 UNION定义
*****************************************************************************/


/*****************************************************************************
  9 OTHERS定义
*****************************************************************************/

/*****************************************************************************
  H2ASN顶级消息结构定义
*****************************************************************************/

/*****************************************************************************
  10 函数声明
*****************************************************************************/
MTA_MTC_SENSOR_STAT_ENUM_UINT8 MTC_GetSensorStat(VOS_VOID);

MTA_MTC_SCREEN_STAT_ENUM_UINT8 MTC_GetScreenStat(VOS_VOID);

/*****************************************************************************
 函 数 名  : MTC_GetCurrentHour
 功能描述  : 调用底软接口，获取当前手机时间中的小时信息。目前时区固定为东八区，
             即北京时间。请确认在中国大陆再调用该接口获取时间，否则可能不准确
 输入参数  : VOS_UINT32 *ulHour
 输出参数  : *ulHour: 0~23
 返 回 值  : 成功: 0；失败: -1
*****************************************************************************/
VOS_INT32 MTC_GetCurrentHour(VOS_UINT32 *ulHour);

#if (FEATURE_ON == FEATURE_UE_MODE_CDMA)
VOS_UINT32 MTC_IsInLowPowerState(
    VOS_VOID
);
#endif

#if ((VOS_OS_VER == VOS_WIN32) || (VOS_OS_VER == VOS_NUCLEUS))
#pragma pack()
#else
#pragma pack(0)
#endif

#ifdef __cplusplus
    #if __cplusplus
        }
    #endif
#endif

#endif /* end of MtcInterface.h */

