/******************************************************************************

                  版权所有 (C), 2001-2011, 华为技术有限公司

 ******************************************************************************
  文 件 名   : TLPsBastetInterface.h
  版 本 号   : 初稿
  作    者   : y00151394
  生成日期   : 2015年6月25日
  最近修改   :
  功能描述   : TL PS同BASTET模块接口定义
  函数列表   :
  修改历史   :
  1.日    期   : 2015年6月25日
    作    者   : yechaoling
    修改内容   : 创建文件

******************************************************************************/

#ifndef __TL_PS_BASTET_INTERFACE_H__
#define __TL_PS_BASTET_INTERFACE_H__

#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif


/*****************************************************************************
  1 Include Headfile
*****************************************************************************/
#include "vos.h"

#if (VOS_OS_VER != VOS_WIN32)
#pragma pack(4)
#else
#pragma pack(push, 4)
#endif


/*****************************************************************************
  2 宏定义
*****************************************************************************/

/*最大丢包个数*/
#define TL_BST_IP_PKT_DROP_MAX_NUM          (128)

/*****************************************************************************
  3 枚举定义
*****************************************************************************/

/*****************************************************************************
  枚举名    : BASTET_LPDCP_MSG_TYPE_ENUM
  协议表格  :
  ASN.1描述 :
  枚举说明  : LPDCP和BASTET消息
*****************************************************************************/
enum BASTET_LPDCP_MSG_TYPE_ENUM
{
    ID_BASTET_LPDCP_PKT_DROP_INFO_REPORT          = 0x1,                     /* 向BASTET模块发送丢包信息 */
    ID_BASTET_LPDCP_MSG_TYPE_BUTT
};
typedef VOS_UINT32 BASTET_LPDCP_MSG_TYPE_ENUM_UINT32;


/*****************************************************************************
  枚举名    : LPDCP_BST_PKT_DROP_TYPE_ENUM
  协议表格  :
  ASN.1描述 :
  枚举说明  : LPDCP和BASTET丢包类型枚举
*****************************************************************************/
enum LPDCP_BST_PKT_DROP_TYPE_ENUM
{
    LPDCP_BST_PKT_DROP_TYPE_FREE_PDU                 = 0x1,                          /*清空PDU*/
    LPDCP_BST_PKT_DROP_TYPE_FREE_SDU                 = 0x2,                          /*清空SDU*/
    LPDCP_BST_PKT_DROP_TYPE_BUTT
};
typedef VOS_UINT16 LPDCP_BST_PKT_DROP_TYPE_ENUM_UINT16;


/*****************************************************************************
  4 全局变量声明
*****************************************************************************/


/*****************************************************************************
  5 消息头定义
*****************************************************************************/


/*****************************************************************************
  6 消息定义
*****************************************************************************/


/*****************************************************************************
  7 STRUCT定义
*****************************************************************************/

/*****************************************************************************
 结构名称   : TL_IP_PKT_DROP_INFO_STRU
 协议表格   :
 ASN.1 描述 :
 结构说明   : 丢包信息
*****************************************************************************/
typedef struct
{
    VOS_UINT32                          ulTcpSeq;
    VOS_UINT16                          usSrcPort;
    VOS_UINT16                          usPktDropType;
}TL_IP_PKT_DROP_INFO_STRU;
/*****************************************************************************
 结构名称   : TL_IP_PKT_DROP_INFO_REPORT_STRU
 协议表格   :
 ASN.1 描述 :
 结构说明   : 丢包信息上报消息
*****************************************************************************/
typedef struct
{
    VOS_MSG_HEADER
    BASTET_LPDCP_MSG_TYPE_ENUM_UINT32   enMsgName;
    VOS_UINT32                          ulPktDropCnt;
    TL_IP_PKT_DROP_INFO_STRU            astPktDropInfo[TL_BST_IP_PKT_DROP_MAX_NUM];
}TL_IP_PKT_DROP_INFO_REPORT_STRU;

/*****************************************************************************
  8 UNION定义
*****************************************************************************/


/*****************************************************************************
  9 OTHERS定义
*****************************************************************************/


/*****************************************************************************
  10 函数声明
*****************************************************************************/

/*****************************************************************************
 函数名    : LRLC_UlGetRetxRatio
 功能描述  : 获取LTE RLC层重传比例
 输入参数  : VOS_UINT32 *pulTxPduNum  LTE RLC发送PDU个数, 为累计值
             VOS_UINT32 *pulRetxNum   LTE RLC重传PDU个数, 为累计值
 输出参数  :
 返回值    :

 修改历史     :
  1.日    期  :
    作    者  :
    修改内容  : 新生成函数
*****************************************************************************/
VOS_UINT32 LRLC_UlGetRetxRatio(VOS_UINT32 *pulTxPduNum, VOS_UINT32 *pulRetxNum);

/*****************************************************************************
 函数名    : LRLC_UlGetBufferSize
 功能描述  : 获取LTE 当前缓存数据量
 输入参数  : VOS_UINT32 *pulBufferSize  LTE 当前缓存数据量

 输出参数  :
 返回值    :

 修改历史     :
  1.日    期  :
    作    者  :
    修改内容  : 新生成函数
*****************************************************************************/
VOS_UINT32 LRLC_UlGetBufferSize(VOS_UINT32 *pulBufferSize);

/*****************************************************************************
 函数名    : LRRC_GetServiceCellInfo
 功能描述  : 获取TDS RLC重传比例
 输入参数  : VOS_UINT32 *pulTxPduNum  TDS RLC发送PDU个数, 为累计值
             VOS_UINT32 *pulRetxNum   TDS RLC重传PDU个数, 为累计值
 输出参数  :
 返回值    :

 修改历史     :
  1.日    期  :
    作    者  :
    修改内容  : 新生成函数
*****************************************************************************/
VOS_UINT32 TRLC_UlGetRetxRatio(VOS_UINT32 *pulTxPduNum, VOS_UINT32 *pulRetxNum);

/*****************************************************************************
 函数名    : TRLC_UlGetBufferSize
 功能描述  : 获取TDS当前缓存数据量
 输入参数  : VOS_UINT32 *pulBufferSize  TDS当前缓存数据量

 输出参数  :
 返回值    :

 修改历史     :
  1.日    期  :
    作    者  :
    修改内容  : 新生成函数
*****************************************************************************/
VOS_UINT32 TRLC_UlGetBufferSize(VOS_UINT32 *pulBufferSize);

/*****************************************************************************
 函数名    : TL_BST_GetSupportFlg
 功能描述  : 获取当前是否支持BST特性
 输入参数  :

 输出参数  :
 返回值    :

 修改历史     :
  1.日    期  :
    作    者  :
    修改内容  : 新生成函数
*****************************************************************************/
VOS_UINT32 TL_BST_GetBstSupportFlg(VOS_VOID);


#if (VOS_OS_VER != VOS_WIN32)
#pragma pack()
#else
#pragma pack(pop)
#endif



#ifdef __cplusplus
    #if __cplusplus
        }
    #endif
#endif

#endif

