/******************************************************************************

                  版权所有 (C), 2015, 华为技术有限公司

 ******************************************************************************
  文 件 名   : BastetTafinterface.h
  版 本 号   : 初稿
  作    者   : l00220658
  生成日期   : 2015年12月29日
  最近修改   :
  功能描述   : Taf和Bastet模块接口头文件定义
  函数列表   :
  修改历史   :
  1.日    期   : 2015年12月29日
    作    者   : l00220658
    修改内容   : 创建文件

******************************************************************************/

#ifndef __BASTETTAFINTERFACE_H__
#define __BASTETTAFINTERFACE_H__

#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif


/*****************************************************************************
  1 其他头文件包含
*****************************************************************************/
#include "vos.h"
#pragma pack(4)

/*****************************************************************************
  2 宏定义
*****************************************************************************/
#define BST_MAX_CALL_NUM_COUNT                ( 64 )
#define BST_MN_BAR_RULE_NONE                  ( 0x00 )
#define BST_MN_BAR_RULE_ALL                   ( 0x01 )
#define BST_MN_BAR_RULE_BLACK                 ( 0x02 )
#define BST_MN_BAR_RULE_ALL_AND_BLACK         ( 0x03 )

#define BST_MN_BAR_SMS_FLAG                   ( 0x01 )
#define BST_MN_BAR_CALL_FLAG                  ( 0x02 )
#define BST_MN_BAR_SMS_CALL_FLAG              ( 0x03 )

#define MN_BST_CALL_BARRED_NUM                ( 5 )
#define MN_BST_SMS_BARRED_NUM                 ( 10 )

/*****************************************************************************
  3 枚举定义
*****************************************************************************/
typedef enum
{
    /*BASTET->MN*/
    ID_BST_MN_CONFIG_BLACKLIST           = 0,
    ID_BST_MN_CLEAR_BLACKLIST,
    ID_BST_MN_SCREEN_STATE,
    ID_BST_MN_SET_BAR_CONTROL,
    ID_BST_MN_RX_RCV_IND,

    /*MN->BASTET*/
    ID_MN_BST_REPORT_BARRED_INFO,
    ID_BST_MN_MSG_BUTT
}BST_MN_PRIM_MSG_ENUM;

typedef VOS_UINT16  BST_MN_PRIM_MSG_ENUM_U16;

/*****************************************************************************
  4 STRUCT定义
*****************************************************************************/
typedef struct
{
    VOS_MSG_HEADER                                                            /*消息头*/
    VOS_UINT32                          ulMsgName;
    VOS_UINT32                          ulDataLen;                            /*用户数据的长度*/
    VOS_UINT8                           aucData[4];                           /*用户数据地址*/
}BST_MN_PRIM_MSG_STRU;

/*****************************************************************************
  5 全局变量声明
*****************************************************************************/


/*****************************************************************************
  6 消息头定义
*****************************************************************************/


/*****************************************************************************
  7 消息定义
*****************************************************************************/


/*****************************************************************************
  8 UNION定义
*****************************************************************************/


/*****************************************************************************
  9 OTHERS定义
*****************************************************************************/


/*****************************************************************************
  10 函数声明
*****************************************************************************/


#if (VOS_OS_VER == VOS_WIN32)
#pragma pack()
#else
#pragma pack(0)
#endif




#ifdef __cplusplus
    #if __cplusplus
        }
    #endif
#endif

#endif /* end of BastetTafinterface.h */
